{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing files, components, and test IDs for generating an Android release APK.",
  "frontend-file-summaries.txt": "JSON-like text containing prewritten summaries of various frontend source files.",
  "frontend/ANDROID_RELEASE.md": "Guide describing prerequisites and steps for building a Phoenix Boutique Android release APK.",
  "frontend/android/keystore.properties.example": "Example keystore properties file showing required fields for Android release signing.",
  "frontend/android/keystores/README.md": "README explaining keystore storage, security warnings, and keystore generation for release signing.",
  "frontend/build-outputs/.gitkeep": "Placeholder file to keep the build-outputs directory in version control.",
  "frontend/index.css": "Global Tailwind-based styles defining theme variables and dark mode settings, plus base styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/scripts/build-android-release-apk.sh": "Shell script that builds the release APK, syncs Capacitor, and copies the final APK to build-outputs.",
  "frontend/src/App.tsx": "App root initializing offline DB, then rendering NavigationProvider and AppShell.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for managing Internet Identity authentication, login, logout, and state.",
  "frontend/src/hooks/useOrdersLiveQuery.ts": "React Query hooks for live-updating all, recent, and single orders using IndexedDB change events.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme CSS variables and print‑specific styles.",
  "frontend/src/layout/AppShell.tsx": "App layout component rendering header, active screen content, and bottom navigation.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/navigation/BottomNav.tsx": "Bottom navigation bar enabling screen switches for dashboard, new order, and orders list.",
  "frontend/src/navigation/NavigationProvider.tsx": "Navigation context handling current screen, navigation actions, and selected order state.",
  "frontend/src/screens/AuditAccountsScreen.tsx": "Audit and accounts view providing date filters and computed financial metrics based on orders.",
  "frontend/src/screens/DashboardScreen.tsx": "Dashboard displaying order metrics and recent orders with navigation to order details.",
  "frontend/src/screens/EditOrderScreen.tsx": "Order editing form that loads an order, manages pricing logic, validates inputs, and saves updates.",
  "frontend/src/screens/NewOrderScreen.tsx": "Form UI for creating a new order with validation, price calculations, and submission to createOrder.",
  "frontend/src/screens/OrderDetailsScreen.tsx": "Displays detailed information for a selected order with status badges and a payment update dialog.",
  "frontend/src/screens/OrdersListScreen.tsx": "Lists all orders with status indicators and navigates to order details or reports.",
  "frontend/src/screens/PrintableAuditSummaryScreen.tsx": "Generates a printable weekly and monthly audit summary with totals and order breakdowns.",
  "frontend/src/screens/PrintableSummaryScreen.tsx": "Provides a printable view of today's and this week's orders with delivery details.",
  "frontend/src/screens/ReportsScreen.tsx": "Offers export options for multiple order ranges and navigation to printable summary and audit views.",
  "frontend/src/screens/UpdatePaymentDialog.tsx": "React dialog for updating an order’s payment, handling validation, previews, history entries, and saving via updateOrderPayment.",
  "frontend/src/services/auditCalculations.ts": "Provides date‑filtered audit calculations for orders, including revenue, collected amounts, outstanding totals, and status counts.",
  "frontend/src/services/currencyFormat.ts": "Utility functions to format numbers as INR currency with or without decimals, handling invalid inputs safely.",
  "frontend/src/services/localDb.ts": "IndexedDB adapter for offline order storage with schema migrations and basic read/write helpers.",
  "frontend/src/services/offlineInit.ts": "Initializes offline persistence by setting up IndexedDB with error handling.",
  "frontend/src/services/orderCsvExport.ts": "Generates CSV strings for full order exports and audit exports and triggers browser downloads.",
  "frontend/src/services/orderQueries.ts": "Provides date‑based utilities and functions to compute dashboard metrics like deliveries due and pending counts.",
  "frontend/src/services/ordersRepository.ts": "IndexedDB order repository with normalization logic and helpers to read all orders, recent orders, and single orders.",
  "frontend/src/services/paymentCalculations.ts": "Utility functions for calculating balance, deriving payment status, and validating pricing fields.",
  "frontend/src/shared/ui/notify.ts": "Lightweight console‑based success/error notification helper.",
  "frontend/src/shared/ui/ScreenTitle.tsx": "Simple React component that renders a styled section title.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings.",
  "project_state.json": "Project state file describing app scope, architecture, existing features, and known issues."
}