{
  "backend/main.mo": "Minimal Motoko actor with no defined methods.",
  "feature_evidence.json": "Feature evidence report listing implemented audit logging and related app features with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in the application.",
  "frontend/.env.example": "Example environment variable file showing required Firebase configuration keys.",
  "frontend/ANDROID_RELEASE.md": "Guide explaining prerequisites and steps to build an Android release APK using Capacitor.",
  "frontend/android/keystore.properties.example": "Example Android keystore configuration file demonstrating required fields for release signing.",
  "frontend/android/keystores/README.md": "Instructions and security warnings for managing Android signing keystores without committing them to version control.",
  "frontend/build-outputs/.gitkeep": "Empty placeholder file ensuring the build-outputs directory is tracked.",
  "frontend/FIREBASE_SETUP.md": "Setup guide explaining how to configure Firebase and install required tools for cloud sync.",
  "frontend/index.css": "Global Tailwind CSS base and theme variables defining the app’s color system and dark mode styles.",
  "frontend/index.html": "Base HTML file that loads the React application root and main entry script.",
  "frontend/README.md": "Project overview and quick start instructions for the Phoenix Boutique offline-first order management app.",
  "frontend/scripts/build-android-release-apk.sh": "Shell script that builds the web assets, syncs Capacitor, compiles a release APK, and copies it to build-outputs.",
  "frontend/src/App.tsx": "Root React component that initializes the offline DB, sets up providers, and loads the main app shell.",
  "frontend/src/components/AutoSyncManager.tsx": "Invisible component that triggers automatic order sync logic through a custom hook.",
  "frontend/src/firebase/auditLogs.ts": "Best-effort Firestore audit logging service providing functions to write and read audit log entries without breaking offline behavior.",
  "frontend/src/firebase/auth.ts": "Provides email signup, signin, and signout helpers using dynamically imported Firebase Auth with clear errors when unavailable.",
  "frontend/src/firebase/firebaseApp.ts": "Initializes Firebase services via dynamic imports only when config exists, exposing getters for app, auth, firestore, and storage.",
  "frontend/src/firebase/firebaseConfig.ts": "Loads Firebase config from environment variables and returns a typed config object with an isConfigured flag.",
  "frontend/src/firebase/FirebaseProvider.tsx": "React provider that exposes Firebase configuration state and initialized Auth, Firestore, and Storage instances.",
  "frontend/src/firebase/firestoreOrders.ts": "Uploads or updates order documents in Firestore using dynamic imports, sending only defined fields for idempotent writes.",
  "frontend/src/firebase/storageImages.ts": "Handles Firebase Storage image upload and deletion using dynamic imports, generating deterministic per-user paths.",
  "frontend/src/firebase/useFirebaseAuth.ts": "React hook that tracks Firebase auth state with a dynamically imported listener and exposes user and loading flags.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useOrdersAutoSync.ts": "Automatically triggers order sync based on connectivity, Firebase availability, authentication, and role, with throttling and state guards.",
  "frontend/src/hooks/useOrdersLiveQuery.ts": "Provides React Query hooks for fetching all, recent, or single orders and auto‑refreshing on local DB change events.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode, and print‑specific styling.",
  "frontend/src/layout/AppShell.tsx": "Renders the main app layout, routing screens based on navigation state and enforcing role‑based access checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/navigation/BottomNav.tsx": "Implements the bottom navigation bar with buttons for dashboard, new order, and orders list.",
  "frontend/src/navigation/NavigationProvider.tsx": "Provides navigation context storing the current screen and optional state, with a navigateTo helper.",
  "frontend/src/rbac/RoleProvider.tsx": "Manages user role with localStorage persistence and exposes derived permissions.",
  "frontend/src/rbac/roleTypes.ts": "Defines role and permissions types and returns permission sets for ADMIN or STAFF.",
  "frontend/src/rbac/useRole.ts": "Hook for accessing role and permissions from RoleProvider.",
  "frontend/src/screens/AuditAccountsScreen.tsx": "Admin‑only audit screen that filters orders by time range and computes financial metrics for display.",
  "frontend/src/screens/AuditLogsScreen.tsx": "ADMIN-only screen that loads recent Firestore audit logs with handling for access, configuration, auth, loading, and error states.",
  "frontend/src/screens/DashboardScreen.tsx": "Displays order metrics and recent orders with UI tiles and navigation, using live queries and computed dashboard metrics.",
  "frontend/src/screens/EditOrderScreen.tsx": "Loads an existing order, pre-fills a form, validates and updates it, and writes audit logs on changes.",
  "frontend/src/screens/NewOrderScreen.tsx": "Form for creating a new order with validation, pricing calculations, and audit log write on submission.",
  "frontend/src/screens/OrderDetailsScreen.tsx": "Shows detailed order info with edit/delete actions, payment dialog, and audit logging on delete.",
  "frontend/src/screens/OrdersListScreen.tsx": "Lists all orders with status, delivery date, and optional financials, allowing navigation to order details.",
  "frontend/src/screens/PrintableAuditSummaryScreen.tsx": "Renders an admin‑only printable audit summary showing weekly and monthly metrics and detailed order lists with print support.",
  "frontend/src/screens/PrintableSummaryScreen.tsx": "Displays an admin‑only printable summary of today’s and this week’s orders with status badges and print functionality.",
  "frontend/src/screens/ReportsScreen.tsx": "Provides the main reports dashboard with CSV export, printable report navigation, Firebase auth UI, sync controls, and admin‑only sections.",
  "frontend/src/screens/StaffManagementScreen.tsx": "Shows an admin‑only staff management placeholder screen gated by Firebase configuration and authentication.",
  "frontend/src/screens/UpdatePaymentDialog.tsx": "Dialog for updating an order’s payment details, validating inputs, updating history, and writing audit logs.",
  "frontend/src/services/auditCalculations.ts": "Contains pure utilities for filtering orders by date ranges and computing audit metrics such as revenue and outstanding amounts.",
  "frontend/src/services/currencyFormat.ts": "Provides INR currency formatting helpers with safe handling for invalid values.",
  "frontend/src/services/localDb.ts": "Initializes and migrates an IndexedDB store for orders, adding pricing, payment, and sync metadata fields across versions.",
  "frontend/src/services/offlineInit.ts": "Bootstraps offline mode by initializing IndexedDB with error handling.",
  "frontend/src/services/orderCsvExport.ts": "Generates CSV strings for orders and audit exports and provides browser download utilities.",
  "frontend/src/services/orderImagesLocal.ts": "Provides local-only image storage utilities, including data URL conversion and ID generation.",
  "frontend/src/services/orderQueries.ts": "Computes dashboard metrics and date-based filters for orders using local-timezone logic.",
  "frontend/src/services/ordersRepository.ts": "Typed IndexedDB repository for orders with normalization of pricing, payment, and sync-tracking fields.",
  "frontend/src/services/ordersSyncService.ts": "Synchronizes local orders and images with Firebase using role-based sanitization and per-order isolation.",
  "frontend/src/services/paymentCalculations.ts": "Calculates balance, derives payment status, and validates pricing fields for order forms.",
  "frontend/src/services/syncStatusStore.ts": "Manages sync status in localStorage, providing getters and helpers for success and error updates.",
  "frontend/src/shared/hooks/useOnlineStatus.ts": "React hook that tracks and returns the browser’s online/offline state via window events.",
  "frontend/src/shared/ui/AccessDeniedScreen.tsx": "UI screen showing an access-denied message with a button to return to the dashboard.",
  "frontend/src/shared/ui/notify.ts": "Console-based success/error notification helper for offline-friendly feedback.",
  "frontend/src/shared/ui/RestrictedInlineMessage.tsx": "Inline alert component displaying an ADMIN-access-required message.",
  "frontend/src/shared/ui/ScreenTitle.tsx": "Simple component rendering a styled screen title heading.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Describes project scope, architecture, features, and known issues for the Phoenix Boutique app."
}