{
  "kind": "build_request",
  "title": "Add Firestore audit logging for order actions and ADMIN-only audit log viewer",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-77",
      "text": "Implement a Firestore audit logging service that writes documents to the `/auditLogs` collection for these actions: Order created, Order updated, Payment updated, Order deleted. Each log entry must include: action (string enum), orderId (use the human-facing `order.orderId`), localId when available, actor userId, actor role, timestamp, and a small `details` object for action-specific metadata (e.g., payment amount/mode for payment updates). Logging must be best-effort and must not break offline-first behavior: if Firebase/Firestore is not configured or the user is not authenticated, the app must continue normally and the audit write must be skipped with a safe error message (no crashes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Add audit logging.\n\nLog these actions:\n- Order created\n- Order updated\n- Payment updated\n- Order deleted\n\nStore logs in Firestore (/auditLogs).",
          "Only ADMIN should be able to view logs."
        ]
      },
      "acceptanceCriteria": [
        "A new frontend service module exists for audit logging (e.g., `frontend/src/firebase/auditLogs.ts`) and uses the existing Firebase dynamic-import pattern (as in `frontend/src/firebase/firestoreOrders.ts`).",
        "When Firestore is unavailable/unconfigured, calling the audit logging function does not throw to the UI; it returns a non-fatal result.",
        "Audit log documents are written under the `/auditLogs` collection when Firestore is configured and a Firebase user is signed in.",
        "All user-facing errors/messages related to audit logging are in English."
      ]
    },
    {
      "id": "REQ-78",
      "text": "Wire audit logging calls into the existing app flows so the correct audit action is recorded at the time the action occurs: (1) after a successful local order creation, (2) after a successful local order update (including edits), (3) after a successful payment update (from the Update Payment dialog), and (4) after a successful order delete. Use the currently authenticated Firebase user (uid) and current role state when available; do not introduce any new authentication requirements for core app usage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Log these actions:\n- Order created\n- Order updated\n- Payment updated\n- Order deleted",
          "Only ADMIN should be able to view logs."
        ]
      },
      "acceptanceCriteria": [
        "Creating a new order triggers a single `Order created` audit log write (when signed in and Firestore configured).",
        "Editing an order triggers a single `Order updated` audit log write (when signed in and Firestore configured).",
        "Updating payment via `frontend/src/screens/UpdatePaymentDialog.tsx` triggers a single `Payment updated` audit log write and includes payment-specific details (at minimum: mode and resultingAdvancePaid; include amountChanged when mode is add-payment).",
        "Deleting an order triggers a single `Order deleted` audit log write (when signed in and Firestore configured).",
        "If the user is offline or not signed in, create/edit/payment/delete still work locally with no crashes and no blocking prompts beyond existing sync/auth rules."
      ]
    },
    {
      "id": "REQ-79",
      "text": "Add an ADMIN-only Audit Logs screen that lists recent audit log entries from Firestore `/auditLogs` in reverse chronological order (newest first), with clear English labels and formatting. The screen must be fully inaccessible to STAFF: it must be hidden from STAFF navigation entry points and must show an access denied screen if a STAFF user reaches the route indirectly. Include at minimum: action label, orderId, actor userId (or email if readily available from auth state), and timestamp.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Only ADMIN should be able to view logs."
        ]
      },
      "acceptanceCriteria": [
        "A new screen component exists (e.g., `frontend/src/screens/AuditLogsScreen.tsx`) that reads from Firestore `/auditLogs` when configured and authenticated.",
        "The Audit Logs screen is only visible/accessible when the current role is ADMIN; STAFF users cannot see an entry point and are blocked by RBAC if they navigate to it.",
        "If Firestore is not configured, the screen shows a clear English empty/disabled state explaining that cloud features are not configured.",
        "If authenticated but there are no logs, the screen shows an English empty state (e.g., “No audit logs yet”)."
      ]
    },
    {
      "id": "REQ-80",
      "text": "Integrate the Audit Logs screen into the existing in-app navigation for ADMIN users by adding an entry point in the Reports screen and adding a new navigation route/screen key handled by the app shell routing. Do not modify any immutable frontend paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Only ADMIN should be able to view logs."
        ]
      },
      "acceptanceCriteria": [
        "Reports screen shows an Audit Logs button/link only for ADMIN users.",
        "Navigation to the new audit logs route renders the Audit Logs screen for ADMIN.",
        "Attempting to navigate to the audit logs route as STAFF results in an access denied UI (English) consistent with existing RBAC patterns.",
        "No files in `frontend/immutablePaths` are modified."
      ]
    },
    {
      "id": "REQ-81",
      "text": "Add concise documentation for required Firestore security rules for `/auditLogs` so that only ADMIN can read logs while authenticated users can write logs. Place the snippet in an existing Firebase setup doc (e.g., `frontend/FIREBASE_SETUP.md`) and keep it in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Store logs in Firestore (/auditLogs).\nOnly ADMIN should be able to view logs."
        ]
      },
      "acceptanceCriteria": [
        "Documentation includes a `match /auditLogs/{logId}` rule example that restricts reads to ADMIN and allows writes only for authenticated users.",
        "Documentation explicitly states that the app enforces ADMIN-only viewing in the UI, but Firestore rules must also enforce it server-side."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Store audit logs in Firestore collection `/auditLogs`.",
    "Only ADMIN can view audit logs (enforced in UI and documented Firestore rules).",
    "Do not break offline-first behavior; core app flows must still work without internet/Firebase configured.",
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not add a backend canister/Motoko audit log implementation.",
    "Do not add real-time log streaming or WebSocket-based updates.",
    "Do not add third-party analytics or external logging services.",
    "Do not require audit logs to be stored offline or queued for later upload unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}